SM_для_EDT/src/Catalogs/vftНесоответствия/vftНесоответствия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>vftНесоответствия</name>
  <owners>Catalog.vftДокладыОНесоответствии</owners>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректирующиеДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКомментарийНесоответствие</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяРешениеКомпании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписаниеНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеКорректирующийхДействий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредписанныеСрокиУстранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемыеСрокиУстранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственныйРешение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИООтветственныйРешение</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействияПринятыеДляУстранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКомментарийДонесение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДонесенияОбУстранении</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДонесения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуютсяПредупреждающиеДействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МерыПоПредотвращениюПовторенияНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредписанныеСрокиПредупреждающихДействий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемыеСрокиВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственныйПредупреждающиеДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИООтветственныйПредупреждающиеДействия</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗамечания</name>
    <type>
      <types>EnumRef.рарусТипыЗамечания</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаПредупреждающиеДействия</name>
    <type>
      <types>CatalogRef.рарусЗоныОтветственности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодУстраненияЗамечания</name>
    <type>
      <types>CatalogRef.рарусКлассификаторыКодовУстраненияЗамечаний</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЗамечаний</name>
    <type>
      <types>CatalogRef.рарусКлассификаторыКодовЗамечаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторяющеесяЗамечания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПКДОтправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПКД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредупреждающиеДействия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечаниеЗакрыто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиоОтветственногоЗаЗакрытиеЗамечания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецЗамечания</name>
    <type>
      <types>CatalogRef.vftДокладыОНесоответствии</types>
      <types>DocumentRef.рарусМероприятиеСУБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьСоздания</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросАнкетирования</name>
    <comment>rarus zalikh</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеССайтаOCIMF</name>
    <comment>zalikh</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОВыполненииПКДОтправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиОтчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиоОтветственногоЗаОтметкуОВыполнении</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтветственныеПодразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.vftПодразделенияКомпании</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветственныеПодразделенияЗаПредупреждающиеДействия</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.vftПодразделенияКомпании</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗоныОтветственности</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗанаОтветственности</name>
      <type>
        <types>CatalogRef.рарусЗоныОтветственности</types>
      </type>
    </attributes>
    <attributes>
      <name>КорректирующиеДействия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемыеСрокиУстранения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьОтветственного</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИООтветственного</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПоЗамечанию</name>
    <attributes>
      <name>ДокументОтражающийДефект</name>
      <type>
        <types>DocumentRef.впЗаявкаНаСнабжение</types>
        <types>DocumentRef.впВыявленныеДефекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/vftНесоответствия/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	 //СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	 //Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	// ++ rarus zalikh 2021-04-28 [27313]
	//устанавливаем отбор, если он есть, по документу "МероприятиеСУБ"
	Если Параметры.Свойство("ОтборПоМероприятиюСУБ") Тогда
		Параметры.Свойство("ОтборПоМероприятиюСУБ", ОтборПоМероприятиюСУБ);
		Настройки = Список.КомпоновщикНастроек.ФиксированныеНастройки;
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВладелецЗамечания");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ОтборПоМероприятиюСУБ;
	КонецЕсли;
	//устанавливаем отбор, если он есть, по ПВХ "ВопросыДляАнкетирования"
	Если Параметры.Свойство("ОтборПоВопросуДляАнкетирования") Тогда
		Параметры.Свойство("ОтборПоВопросуДляАнкетирования", ОтборПоВопросуДляАнкетирования);
		Настройки = Список.КомпоновщикНастроек.ФиксированныеНастройки;
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВопросАнкетирования");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ОтборПоВопросуДляАнкетирования;
	КонецЕсли;
	// -- rarus zalikh 2021-04-28
	Если Параметры.Свойство("ОткрытыйОтвет") Тогда
		ОткрытыйОтвет = Параметры.ОткрытыйОтвет;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	

	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить(); 
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Закрыт");
	ЭлементОтбора.Использование = Истина; 
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СветлоСерый);
	ЭлементОформления.Использование = Истина;
	

	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить(); 
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Получен");
	ЭлементОтбора.Использование = Истина; 
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноОранжевый);
	ЭлементОформления.Использование = Истина;
	
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить(); 
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Отправлен");
	ЭлементОтбора.Использование = Истина; 
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Зеленый);
	ЭлементОформления.Использование = Истина;

	                                                              
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;	
		
	Если ЗначениеЗаполнено(ОтборПоМероприятиюСУБ) И ЗначениеЗаполнено(ОтборПоВопросуДляАнкетирования) Тогда
		
		ЗначениеРеквизитовМероприятия = ПолучитьЗначениеРеквизитовДляЗаполнения(ОтборПоМероприятиюСУБ, 
		                                                                        ОтборПоВопросуДляАнкетирования);
		
		ПараметрыЗаполнения = Новый Структура;     
		ПараметрыЗаполнения.Вставить("Судно", ЗначениеРеквизитовМероприятия.Судно);
		ПараметрыЗаполнения.Вставить("Дата",  ЗначениеРеквизитовМероприятия.Дата);
		ПараметрыЗаполнения.Вставить("ВладелецЗамечания", ОтборПоМероприятиюСУБ);
		ПараметрыЗаполнения.Вставить("ВопросАнкетирования", ОтборПоВопросуДляАнкетирования);
		ПараметрыЗаполнения.Вставить("ОписаниеНесоответствия", ОткрытыйОтвет);

		ОткрытьФорму("Справочник.vftНесоответствия.Форма.ФормаЭлементаСУБ",
		        Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения), ЭтотОбъект,,,,);
		
	Иначе	
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Невозможно создать замечание из анкеты.';
		|en = 'Unable to create a comment from a questionnaire.'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитовДляЗаполнения(ДокументМероприятие, ВопросАнкет)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументМероприятие, "Судно, Дата");
	
КонецФункции

#КонецОбласти
